10/data/attachments/bad2b4f8905d9d2b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Shannon_brother_Friend_99521_5</nif:username>
            <nif:friendToBeRequested>soap_friends_aba59d26-f461-41ba-8077-d03ad1626624</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>